Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFM064.atdf
         <register caption="CAN Filter Control Register 3" name="C2FLTCON3" offset="0x10f0" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL12" values="C2FLTCON3__FSEL12"/>
            <bitfield caption="Filter 12 Mask Select bits" mask="0x00000060" name="MSEL12" values="C2FLTCON3__MSEL12"/>
            <bitfield caption="Filter 12 Enable bit" mask="0x00000080" name="FLTEN12" values="C2FLTCON3__FLTEN12"/>
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL13" values="C2FLTCON3__FSEL13"/>
            <bitfield caption="Filter 13 Mask Select bits" mask="0x00006000" name="MSEL13" values="C2FLTCON3__MSEL13"/>
            <bitfield caption="Filter 13 Enable bit" mask="0x00008000" name="FLTEN13" values="C2FLTCON3__FLTEN13"/>
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL14" values="C2FLTCON3__FSEL14"/>
            <bitfield caption="Filter 14 Mask Select bits" mask="0x00600000" name="MSEL14" values="C2FLTCON3__MSEL14"/>
            <bitfield caption="Filter 14 Enable bit" mask="0x00800000" name="FLTEN14" values="C2FLTCON3__FLTEN14"/>
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL15" values="C2FLTCON3__FSEL15"/>
            <bitfield caption="Filter 15 Mask Select bits" mask="0x60000000" name="MSEL15" values="C2FLTCON3__MSEL15"/>
            <bitfield caption="Filter 15 Enable bit" mask="0x80000000" name="FLTEN15" values="C2FLTCON3__FLTEN15"/>
         </register>
         <register caption="CAN Filter Control Register 4" name="C1FLTCON4" offset="0x100" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL16" values="C1FLTCON4__FSEL16"/>
            <bitfield caption="Filter 16 Mask Select bits" mask="0x00000060" name="MSEL16" values="C1FLTCON4__MSEL16"/>
            <bitfield caption="Filter 16 Enable bit" mask="0x00000080" name="FLTEN16" values="C1FLTCON4__FLTEN16"/>
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL17" values="C1FLTCON4__FSEL17"/>
            <bitfield caption="Filter 17 Mask Select bits" mask="0x00006000" name="MSEL17" values="C1FLTCON4__MSEL17"/>
            <bitfield caption="Filter 13 Enable bit" mask="0x00008000" name="FLTEN17" values="C1FLTCON4__FLTEN17"/>
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL18" values="C1FLTCON4__FSEL18"/>
            <bitfield caption="Filter 18 Mask Select bits" mask="0x00600000" name="MSEL18" values="C1FLTCON4__MSEL18"/>
            <bitfield caption="Filter 18 Enable bit" mask="0x00800000" name="FLTEN18" values="C1FLTCON4__FLTEN18"/>
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL19" values="C1FLTCON4__FSEL19"/>
            <bitfield caption="Filter 19 Mask Select bits" mask="0x60000000" name="MSEL19" values="C1FLTCON4__MSEL19"/>
            <bitfield caption="Filter 19 Enable bit" mask="0x80000000" name="FLTEN19" values="C1FLTCON4__FLTEN19"/>
         </register>
         <register caption="CAN Filter Control Register 4" name="C2FLTCON4" offset="0x1100" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL16" values="C2FLTCON4__FSEL16"/>
            <bitfield caption="Filter 16 Mask Select bits" mask="0x00000060" name="MSEL16" values="C2FLTCON4__MSEL16"/>
            <bitfield caption="Filter 16 Enable bit" mask="0x00000080" name="FLTEN16" values="C2FLTCON4__FLTEN16"/>
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL17" values="C2FLTCON4__FSEL17"/>
            <bitfield caption="Filter 17 Mask Select bits" mask="0x00006000" name="MSEL17" values="C2FLTCON4__MSEL17"/>
            <bitfield caption="Filter 13 Enable bit" mask="0x00008000" name="FLTEN17" values="C2FLTCON4__FLTEN17"/>
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL18" values="C2FLTCON4__FSEL18"/>
            <bitfield caption="Filter 18 Mask Select bits" mask="0x00600000" name="MSEL18" values="C2FLTCON4__MSEL18"/>
            <bitfield caption="Filter 18 Enable bit" mask="0x00800000" name="FLTEN18" values="C2FLTCON4__FLTEN18"/>
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL19" values="C2FLTCON4__FSEL19"/>
            <bitfield caption="Filter 19 Mask Select bits" mask="0x60000000" name="MSEL19" values="C2FLTCON4__MSEL19"/>
            <bitfield caption="Filter 19 Enable bit" mask="0x80000000" name="FLTEN19" values="C2FLTCON4__FLTEN19"/>
         </register>
         <register caption="CAN Filter Control Register 5" name="C1FLTCON5" offset="0x110" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL20" values="C1FLTCON5__FSEL20"/>
            <bitfield caption="Filter 20 Mask Select bits" mask="0x00000060" name="MSEL20" values="C1FLTCON5__MSEL20"/>
            <bitfield caption="Filter 20 Enable bit" mask="0x00000080" name="FLTEN20" values="C1FLTCON5__FLTEN20"/>
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL21" values="C1FLTCON5__FSEL21"/>
            <bitfield caption="Filter 21 Mask Select bits" mask="0x00006000" name="MSEL21" values="C1FLTCON5__MSEL21"/>
            <bitfield caption="Filter 21 Enable bit" mask="0x00008000" name="FLTEN21" values="C1FLTCON5__FLTEN21"/>
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL22" values="C1FLTCON5__FSEL22"/>
            <bitfield caption="Filter 22 Mask Select bits" mask="0x00600000" name="MSEL22" values="C1FLTCON5__MSEL22"/>
            <bitfield caption="Filter 22 Enable bit" mask="0x00800000" name="FLTEN22" values="C1FLTCON5__FLTEN22"/>
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL23" values="C1FLTCON5__FSEL23"/>
            <bitfield caption="Filter 23 Mask Select bits" mask="0x60000000" name="MSEL23" values="C1FLTCON5__MSEL23"/>
            <bitfield caption="Filter 23 Enable bit" mask="0x80000000" name="FLTEN23" values="C1FLTCON5__FLTEN23"/>
         </register>
         <register caption="CAN Filter Control Register 5" name="C2FLTCON5" offset="0x1110" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL20" values="C2FLTCON5__FSEL20"/>
            <bitfield caption="Filter 20 Mask Select bits" mask="0x00000060" name="MSEL20" values="C2FLTCON5__MSEL20"/>
            <bitfield caption="Filter 20 Enable bit" mask="0x00000080" name="FLTEN20" values="C2FLTCON5__FLTEN20"/>
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL21" values="C2FLTCON5__FSEL21"/>
            <bitfield caption="Filter 21 Mask Select bits" mask="0x00006000" name="MSEL21" values="C2FLTCON5__MSEL21"/>
            <bitfield caption="Filter 21 Enable bit" mask="0x00008000" name="FLTEN21" values="C2FLTCON5__FLTEN21"/>
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL22" values="C2FLTCON5__FSEL22"/>
            <bitfield caption="Filter 22 Mask Select bits" mask="0x00600000" name="MSEL22" values="C2FLTCON5__MSEL22"/>
            <bitfield caption="Filter 22 Enable bit" mask="0x00800000" name="FLTEN22" values="C2FLTCON5__FLTEN22"/>
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL23" values="C2FLTCON5__FSEL23"/>
            <bitfield caption="Filter 23 Mask Select bits" mask="0x60000000" name="MSEL23" values="C2FLTCON5__MSEL23"/>
            <bitfield caption="Filter 23 Enable bit" mask="0x80000000" name="FLTEN23" values="C2FLTCON5__FLTEN23"/>
         </register>
         <register caption="CAN Filter Control Register 6" name="C1FLTCON6" offset="0x120" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL24" values="C1FLTCON6__FSEL24"/>
            <bitfield caption="Filter 24 Mask Select bits" mask="0x00000060" name="MSEL24" values="C1FLTCON6__MSEL24"/>
            <bitfield caption="Filter 24 Enable bit" mask="0x00000080" name="FLTEN24" values="C1FLTCON6__FLTEN24"/>
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL25" values="C1FLTCON6__FSEL25"/>
            <bitfield caption="Filter 25 Mask Select bits" mask="0x00006000" name="MSEL25" values="C1FLTCON6__MSEL25"/>
            <bitfield caption="Filter 25 Enable bit" mask="0x00008000" name="FLTEN25" values="C1FLTCON6__FLTEN25"/>
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL26" values="C1FLTCON6__FSEL26"/>
            <bitfield caption="Filter 26 Mask Select bits" mask="0x00600000" name="MSEL26" values="C1FLTCON6__MSEL26"/>
            <bitfield caption="Filter 26 Enable bit" mask="0x00800000" name="FLTEN26" values="C1FLTCON6__FLTEN26"/>
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL27" values="C1FLTCON6__FSEL27"/>
            <bitfield caption="Filter 27 Mask Select bits" mask="0x60000000" name="MSEL27" values="C1FLTCON6__MSEL27"/>
            <bitfield caption="Filter 27 Enable bit" mask="0x80000000" name="FLTEN27" values="C1FLTCON6__FLTEN27"/>
         </register>
