Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFM064.atdf
      <value-group caption="Receive FIFO Overflow Interrupt Flag bit" name="C2FIFOINT8__RXOVFLIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) Unused, reads 0" name="" value="0x0"/>
         <value caption="0: (FIFO configured as a Receive Buffer) 1 = Overflow event has occurred, 0 = No overflow event occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit FIFO Empty Interrupt Flag bit(1)" name="C2FIFOINT8__TXEMPTYIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) 1 = FIFO is empty, 0 = FIFO is not empty, at least 1 message queued to be transmitted" name="" value="0x0"/>
         <value caption="0: (FIFO configured as a Receive Buffer) Unused, reads 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit(1)" name="C2FIFOINT8__TXHALFIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) 1 = FIFO is ? half full, 0 = FIFO is &gt; half full" name="" value="0x0"/>
         <value caption="0: (FIFO configured as a Receive Buffer) Unused, reads 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit FIFO Not Full Interrupt Flag bit(1)" name="C2FIFOINT8__TXNFULLIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) 1 = FIFO is not full, 0 = FIFO is full" name="" value="0x0"/>
         <value caption="0: (FIFO configured as a Receive Buffer) Unused, reads 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Empty Interrupt Enable bit" name="C2FIFOINT8__RXNEMPTYIE">
         <value caption="Interrupt enabled for FIFO not empty" name="" value="0x1"/>
         <value caption="Interrupt disabled for FIFO not empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Half Full Interrupt Enable bit" name="C2FIFOINT8__RXHALFIE">
         <value caption="Interrupt enabled for FIFO half full" name="" value="0x1"/>
         <value caption="Interrupt disabled for FIFO half full" name="" value="0x0"/>
      </value-group>
      <value-group caption="Full Interrupt Enable bit" name="C2FIFOINT8__RXFULLIE">
         <value caption="Interrupt enabled for FIFO full" name="" value="0x1"/>
         <value caption="Interrupt disabled for FIFO full" name="" value="0x0"/>
      </value-group>
      <value-group caption="Overflow Interrupt Enable bit" name="C2FIFOINT8__RXOVFLIE">
         <value caption="Interrupt enabled for overflow event" name="" value="0x1"/>
         <value caption="Interrupt disabled for overflow event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit FIFO Empty Interrupt Enable bit" name="C2FIFOINT8__TXEMPTYIE">
         <value caption="Interrupt enabled for FIFO empty" name="" value="0x1"/>
         <value caption="Interrupt disabled for FIFO empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit FIFO Half Full Interrupt Enable bit" name="C2FIFOINT8__TXHALFIE">
         <value caption="Interrupt enabled for FIFO half full" name="" value="0x1"/>
         <value caption="Interrupt disabled for FIFO half full" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit FIFO Not Full Interrupt Enable bit" name="C2FIFOINT8__TXNFULLIE">
         <value caption="Interrupt enabled for FIFO not full" name="" value="0x1"/>
         <value caption="Interrupt disabled for FIFO not full" name="" value="0x0"/>
      </value-group>
      <value-group caption="Message Transmit Priority bits" name="C1FIFOCON9__TXPRI">
         <value caption="Highest Message Priority" name="" value="0x3"/>
         <value caption="High Intermediate Message Priority" name="" value="0x2"/>
         <value caption="Low Intermediate Message Priority" name="" value="0x1"/>
         <value caption="Lowest Message Priority" name="" value="0x0"/>
      </value-group>
      <value-group caption="Auto RTR Enable bit" name="C1FIFOCON9__RTREN">
         <value caption="When a remote transmit is received, TXREQ will be set" name="" value="0x1"/>
         <value caption="When a remote transmit is received, TXREQ will be unaffected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Message Send Request" name="C1FIFOCON9__TXREQ">
         <value caption="1: (FIFO configured as a Transmit FIFO) Setting this bit to 1 requests sending a message. The bit will automatically clear when all the messages queued in the FIFO are successfully sent. Clearing the bit to 0 while set (1) will request a message abort." name="" value="0x0"/>
         <value caption="0: (FIFO configured as a Receive FIFO) This bit has no effect." name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Detected During Transmission bit(3)" name="C1FIFOCON9__TXERR">
         <value caption="A bus error occurred while the message was being sent" name="" value="0x1"/>
         <value caption="A bus error did not occur while the message was being sent" name="" value="0x0"/>
      </value-group>
      <value-group caption="Message Lost Arbitration bit(3)" name="C1FIFOCON9__TXLARB">
         <value caption="Message lost arbitration while being sent" name="" value="0x1"/>
         <value caption="Message did not lose arbitration while being sent" name="" value="0x0"/>
      </value-group>
      <value-group caption="Message Aborted bit(2)" name="C1FIFOCON9__TXABAT">
         <value caption="Message was aborted" name="" value="0x1"/>
         <value caption="Message completed successfully" name="" value="0x0"/>
      </value-group>
      <value-group caption="TX/RX Buffer Selection bit" name="C1FIFOCON9__TXEN">
         <value caption="FIFO is a Transmit FIFO" name="" value="0x1"/>
         <value caption="FIFO is a Receive FIFO" name="" value="0x0"/>
      </value-group>
      <value-group caption="Store Message Data Only bit(1)" name="C1FIFOCON9__DONLY">
         <value caption="1: (FIFO configured as a Transmit FIFO) This bit is not used and has no effect. " name="" value="0x0"/>
         <value caption="0: (FIFO configured as a Receive FIFO) 1 = Only data bytes will be stored in the FIFO, 0 = Full message is stored, including identifier" name="" value="0x0"/>
      </value-group>
