Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFM064.atdf
         <register caption="" name="U6CTSR" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U6CTSR"/>
         </register>
         <register caption="" name="SDI1R" offset="0x98" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI1R"/>
         </register>
         <register caption="" name="SS1R" offset="0x9c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS1R"/>
         </register>
         <register caption="" name="SDI2R" offset="0xa4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI2R"/>
         </register>
         <register caption="" name="SS2R" offset="0xa8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS2R"/>
         </register>
         <register caption="" name="SDI3R" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI3R"/>
         </register>
         <register caption="" name="SS3R" offset="0xb4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS3R"/>
         </register>
         <register caption="" name="SDI4R" offset="0xbc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI4R"/>
         </register>
         <register caption="" name="SS4R" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS4R"/>
         </register>
         <register caption="" name="C1RXR" offset="0xdc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="C1RXR"/>
         </register>
         <register caption="" name="C2RXR" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="C2RXR"/>
         </register>
         <register caption="" name="REFCLKI1R" offset="0xe4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="REFCLKI1R"/>
         </register>
         <register caption="" name="REFCLKI3R" offset="0xec" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="REFCLKI3R"/>
         </register>
         <register caption="" name="REFCLKI4R" offset="0xf0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="REFCLKI4R"/>
         </register>
      </register-group>
   </module>
   <module caption="" id="01423" name="RPOUT" version="">
      <register-group name="RPOUT">
         <register caption="" name="RPB0R" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB0R"/>
         </register>
         <register caption="" name="RPB1R" offset="0x4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB1R"/>
         </register>
         <register caption="" name="RPB2R" offset="0x8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB2R"/>
         </register>
         <register caption="" name="RPB3R" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB3R"/>
         </register>
         <register caption="" name="RPB5R" offset="0x14" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB5R"/>
         </register>
         <register caption="" name="RPB6R" offset="0x18" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB6R"/>
         </register>
         <register caption="" name="RPB7R" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB7R"/>
         </register>
         <register caption="" name="RPB8R" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB8R"/>
         </register>
         <register caption="" name="RPB9R" offset="0x24" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB9R"/>
         </register>
         <register caption="" name="RPB10R" offset="0x28" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB10R"/>
         </register>
         <register caption="" name="RPB14R" offset="0x38" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB14R"/>
         </register>
         <register caption="" name="RPB15R" offset="0x3c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPB15R"/>
         </register>
         <register caption="" name="RPC13R" offset="0x74" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC13R"/>
         </register>
         <register caption="" name="RPC14R" offset="0x78" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPC14R"/>
         </register>
         <register caption="" name="RPD0R" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD0R"/>
         </register>
         <register caption="" name="RPD1R" offset="0x84" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD1R"/>
         </register>
         <register caption="" name="RPD2R" offset="0x88" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD2R"/>
         </register>
         <register caption="" name="RPD3R" offset="0x8c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD3R"/>
         </register>
         <register caption="" name="RPD4R" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD4R"/>
         </register>
         <register caption="" name="RPD5R" offset="0x94" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD5R"/>
         </register>
         <register caption="" name="RPD9R" offset="0xa4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD9R"/>
         </register>
         <register caption="" name="RPD10R" offset="0xa8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD10R"/>
         </register>
         <register caption="" name="RPD11R" offset="0xac" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD11R"/>
         </register>
         <register caption="" name="RPE3R" offset="0xcc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE3R"/>
         </register>
         <register caption="" name="RPE5R" offset="0xd4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE5R"/>
         </register>
         <register caption="" name="RPF0R" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF0R"/>
         </register>
         <register caption="" name="RPF1R" offset="0x104" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF1R"/>
         </register>
