Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFM064.atdf
      <value-group caption="The boot controller will send the dummy in Single Lange, Dual Lane, or Quad Lane" name="SQI1XCON1__TYPEDUMMY">
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Quad Lane mode dummy is enabled" name="" value="0x2"/>
         <value caption="Dual Lane mode dummy is enabled" name="" value="0x1"/>
         <value caption="Single Lange mode dummy is enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="The boot controller will receive the data in Single Lane, Dual Lane, or Quad Lane." name="SQI1XCON1__TYPEDATA">
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Quad Lane mode data is enabled" name="" value="0x2"/>
         <value caption="Dual Lane mode data is enabled" name="" value="0x1"/>
         <value caption="Single Lane mode data is enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="" name="SQI1XCON1__ADDRBYTES">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x6"/>
         <value caption="Reserved" name="" value="0x5"/>
         <value caption="Four address bytes" name="" value="0x4"/>
         <value caption="Three address bytes" name="" value="0x3"/>
         <value caption="Two address bytes" name="" value="0x2"/>
         <value caption="One address bytes" name="" value="0x1"/>
         <value caption="Zero address bytes" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Dummy Bytes bits" name="SQI1XCON1__DUMMYBYTES">
         <value caption="Transmit seven dummy bytes after the address bytes" name="" value="0x7"/>
         <value caption="Transmit six dummy bytes after the address bytes" name="" value="0x6"/>
         <value caption="Transmit five dummy bytes after the address bytes" name="" value="0x5"/>
         <value caption="Transmit four dummy bytes after the address bytes" name="" value="0x4"/>
         <value caption="Transmit three dummy bytes after the address bytes" name="" value="0x3"/>
         <value caption="Transmit two dummy bytes after the address bytes" name="" value="0x2"/>
         <value caption="Transmit one dummy bytes after the address bytes" name="" value="0x1"/>
         <value caption="Transmit zero dummy bytes after the address bytes" name="" value="0x0"/>
      </value-group>
      <value-group caption="SQI DDR Command Mode bit" name="SQI1XCON1__DDRCMD">
         <value caption="SQI command bytes are transferred in DDR mode" name="" value="0x1"/>
         <value caption="SQI command bytes are transferred in SDR mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="SQI Address Mode bit" name="SQI1XCON1__DDRADDR">
         <value caption="SQI address bytes are transferred in DDR mode" name="" value="0x1"/>
         <value caption="SQI address bytes are transferred in SDR mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="SQI DDR Mode bit" name="SQI1XCON1__DDRMODE">
         <value caption="SQI mode bytes are transferred in DDR mode" name="" value="0x1"/>
         <value caption="SQI mode bytes are transferred in SDR mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="SQI Dummy DDR Mode bit" name="SQI1XCON1__DDRDUMMY">
         <value caption="SQI dummy bytes are transferred in DDR mode" name="" value="0x1"/>
         <value caption="SQI dummy bytes are transferred in SDR mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="SQI Data DDR Mode bit" name="SQI1XCON1__DDRDATA">
         <value caption="SQI data bytes are transferred in DDR mode" name="" value="0x1"/>
         <value caption="SQI data bytes are transferred in SDR mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="SQI Command in SDR Mode bit" name="SQI1XCON1__SDRCMD">
         <value caption="SQI command is in SDR mode and SQI data is in DDR mode" name="" value="0x1"/>
         <value caption="SQI command is in DDR mode and SQI data is in DDR mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Mode Byte Cycle Enable bits" name="SQI1XCON2__MODEBYTES">
         <value caption="Three cycles" name="" value="0x3"/>
         <value caption="Two cycles" name="" value="0x2"/>
         <value caption="One cycle" name="" value="0x1"/>
         <value caption="Zero cycles" name="" value="0x0"/>
      </value-group>
      <value-group caption="Device Select bits" name="SQI1XCON2__DEVSEL">
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Reserved" name="" value="0x2"/>
         <value caption="Device 1 is selected" name="" value="0x1"/>
         <value caption="Device 0 is selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Mode Select bits" name="SQI1CFG__MODE">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x6"/>
         <value caption="Reserved" name="" value="0x5"/>
         <value caption="Reserved" name="" value="0x4"/>
         <value caption="XIP mode is selected (when this mode is entered, the module behaves as if executing in place (XIP),but uses the register data to control timing)" name="" value="0x3"/>
         <value caption="DMA mode is selected" name="" value="0x2"/>
         <value caption="CPU mode is selected (the module is controlled by the CPU in PIO mode. This mode is entered whenleaving Boot or XIP mode)" name="" value="0x1"/>
         <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="Clock Phase Select bit" name="SQI1CFG__CPHA">
         <value caption="SQICLK starts toggling at the start of the first data bit" name="" value="0x1"/>
         <value caption="SQICLK starts toggling at the middle of the first data bit" name="" value="0x0"/>
      </value-group>
      <value-group caption="Clock Polarity Select bit" name="SQI1CFG__CPOL">
         <value caption="Active-low SQICLK (SQICLK high is the Idle state)" name="" value="0x1"/>
         <value caption="Active-high SQICLK (SQICLK low is the Idle state)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Format Select bit" name="SQI1CFG__LSBF">
         <value caption="LSB is send or received first" name="" value="0x1"/>
         <value caption="MSB is sent or received first" name="" value="0x0"/>
      </value-group>
      <value-group caption="Burst Configuration bit" name="SQI1CFG__BURSTEN">
         <value caption="Burst is enabled" name="" value="0x1"/>
         <value caption="Burst is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Software Reset Select bit" name="SQI1CFG__RESET">
         <value caption="A reset pulse is generated" name="" value="0x1"/>
         <value caption="A reset pulse is not generated" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Buffer Reset bit" name="SQI1CFG__TXBUFRST">
         <value caption="A reset pulse is generated clearing the transmit buffer" name="" value="0x1"/>
         <value caption="A reset pulse is not generated" name="" value="0x0"/>
      </value-group>
