Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFM064.atdf
         <register caption="" name="U2RXREG" offset="0x230" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U2RXREG"/>
         </register>
         <register caption="" name="U3RXREG" offset="0x430" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U3RXREG"/>
         </register>
         <register caption="" name="U4RXREG" offset="0x630" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U4RXREG"/>
         </register>
         <register caption="" name="U5RXREG" offset="0x830" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U5RXREG"/>
         </register>
         <register caption="" name="U6RXREG" offset="0xa30" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U6RXREG"/>
         </register>
         <register caption="" name="U1BRG" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="BRG"/>
         </register>
         <register caption="" name="U2BRG" offset="0x240" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="BRG"/>
         </register>
         <register caption="" name="U3BRG" offset="0x440" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="BRG"/>
         </register>
         <register caption="" name="U4BRG" offset="0x640" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="BRG"/>
         </register>
         <register caption="" name="U5BRG" offset="0x840" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="BRG"/>
         </register>
         <register caption="" name="U6BRG" offset="0xa40" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="BRG"/>
         </register>
      </register-group>
      <value-group caption="Stop Selection bit" name="U1MODE__STSEL">
         <value caption="2 Stop bits" name="" value="0x1"/>
         <value caption="1 Stop bit" name="" value="0x0"/>
      </value-group>
      <value-group caption="Parity and Data Selection bits" name="U1MODE__PDSEL">
         <value caption="9-bit data, no parity" name="" value="0x3"/>
         <value caption="8-bit data, odd parity" name="" value="0x2"/>
         <value caption="8-bit data, even parity" name="" value="0x1"/>
         <value caption="8-bit data, no parity" name="" value="0x0"/>
      </value-group>
      <value-group caption="High Baud Rate Enable bit" name="U1MODE__BRGH">
         <value caption="High-Speed mode 4x baud clock enabled" name="" value="0x1"/>
         <value caption="Standard Speed mode 16x baud clock enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Polarity Inversion bit" name="U1MODE__RXINV">
         <value caption="UxRX Idle state is 0" name="" value="0x1"/>
         <value caption="UxRX Idle state is 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Auto-Baud Enable bit" name="U1MODE__ABAUD">
         <value caption="Enable baud rate measurement on the next character requires reception of Sync character (0x55); cleared by hardware upon completion" name="" value="0x1"/>
         <value caption="Baud rate measurement is disabled or completed" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Loopback Mode Select bit" name="U1MODE__LPBACK">
         <value caption="Loopback mode is enabled" name="" value="0x1"/>
         <value caption="Loopback mode is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" name="U1MODE__WAKE">
         <value caption="Wake-up is enabled" name="" value="0x1"/>
         <value caption="Wake-up is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Enable bits" name="U1MODE__UEN">
         <value caption="UxTX" name="" value="0x3"/>
         <value caption="UxTX" name="" value="0x2"/>
         <value caption="UxTX" name="" value="0x1"/>
         <value caption="UxTX and UxRX pins are enabled and used; UxCTS and UxRTS/UxBCLK pins are controlled by corresponding bits in the PORTx register" name="" value="0x0"/>
      </value-group>
      <value-group caption="Mode Selection for UxRTS Pin bit" name="U1MODE__RTSMD">
         <value caption="UxRTS pin is in Simplex mode" name="" value="0x1"/>
         <value caption="UxRTS pin is in Flow Control mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="IrDA Encoder and Decoder Enable bit" name="U1MODE__IREN">
         <value caption="IrDA is enabled" name="" value="0x1"/>
         <value caption="IrDA is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="U1MODE__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1"/>
         <value caption="Continue operation in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Enable bit" name="U1MODE__ON">
         <value caption="UARTx is enabled. UARTx pins are controlled by UARTx as defined by UEN and UTXEN control bits" name="" value="0x1"/>
         <value caption="UARTx is disabled. All UARTx pins are controlled by corresponding bits in the PORTx" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop Selection bit" name="U2MODE__STSEL">
         <value caption="2 Stop bits" name="" value="0x1"/>
         <value caption="1 Stop bit" name="" value="0x0"/>
      </value-group>
      <value-group caption="Parity and Data Selection bits" name="U2MODE__PDSEL">
         <value caption="9-bit data" name="" value="0x3"/>
         <value caption="8-bit data" name="" value="0x2"/>
         <value caption="8-bit data" name="" value="0x1"/>
         <value caption="8-bit data" name="" value="0x0"/>
      </value-group>
      <value-group caption="High Baud Rate Enable bit" name="U2MODE__BRGH">
         <value caption="High-Speed mode 4x baud clock enabled" name="" value="0x1"/>
         <value caption="Standard Speed mode 16x baud clock enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Polarity Inversion bit" name="U2MODE__RXINV">
         <value caption="UxRX Idle state is 0" name="" value="0x1"/>
         <value caption="UxRX Idle state is 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Auto-Baud Enable bit" name="U2MODE__ABAUD">
         <value caption="Enable baud rate measurement on the next character requires reception of Sync character (0x55); cleared by hardware upon completion" name="" value="0x1"/>
         <value caption="Baud rate measurement is disabled or completed" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Loopback Mode Select bit" name="U2MODE__LPBACK">
         <value caption="Loopback mode is enabled" name="" value="0x1"/>
         <value caption="Loopback mode is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" name="U2MODE__WAKE">
         <value caption="Wake-up is enabled" name="" value="0x1"/>
         <value caption="Wake-up is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Enable bits" name="U2MODE__UEN">
         <value caption="UxTX" name="" value="0x3"/>
         <value caption="UxTX" name="" value="0x2"/>
         <value caption="UxTX" name="" value="0x1"/>
         <value caption="UxTX and UxRX pins are enabled and used; UxCTS and UxRTS/UxBCLK pins are controlled by corresponding bits in the PORTx register" name="" value="0x0"/>
      </value-group>
